[
  {
    "path": "posts/kaluga-elections-part1-sudimost/",
    "title": "Выборы Калужской области (Часть 1. Кандидаты с судимостью)",
    "description": "Проанализированы данные о кандидатах в депутаты представительных органов муниципальных образований и Законодательного собрания Калужской области в период с 2009 по 2023 год. Агрегированные сведения об участии кандидатов с судимостью представлены в виде плиточных карт.",
    "author": [],
    "date": "2024-06-30",
    "categories": [
      "калужская область",
      "выборы",
      "депутаты",
      "плиточная карта"
    ],
    "contents": "\r\n\r\nContents\r\nСведения о кандидатах\r\nСведения о судимости кандидатов\r\nСтатистика\r\nО судимостях кандидатов\r\nАнализ статей УК\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\n\r\n\r\n\r\nВ прошлой публикации мы показали как строить плиточную карту Калужской области, самое время применить её для отображения реальных данных. В качестве упражнения решили проанализировать сведения о выборах Калужской области.\r\n\r\n\r\n\r\nСведения о кандидатах\r\n\r\n\r\n\r\nОпределимся с терминами, которые будем использовать:\r\nвыдвижение – участие кандидата в выборах в конкретный орган в отдельный год. Некоторые кандидаты могут иметь несколько выдвижений – в один и тот же орган представительной власти в разные годы, или в разные органы в один год, а иногда и то, и другое.\r\nпредставительные органы - этим терминов будем обозначать всякого рода думы и собрания муниципальных образований, которые в соответствии с определением ст.130-133 Конституции РФ и положениями Федерального закона от 06.10.2003 N 131-ФЗ (ред. от 15.05.2024) “Об общих принципах организации местного самоуправления в Российской Федерации” формируются путем выборов, а также Законодательное собрание Калужской области, которые являются представительным и единственным законодательным органом государственной власти Калужской области.\r\nМы проанализировали сведения о 19210 выдвижениях, захватив 3 волны выборов – 2010, 2015, 2020, а также всё то, что происходило между ними (повторные и дополнительные выборы).\r\n\r\n\r\n\r\n\r\n\r\n\r\nСведения о судимости кандидатов\r\nСведения о кандидатах на сайте ЦИК России приведены в нестандартных форматах (что дали, то и есть). Поэтому нам пришлось потратить некоторое время на проверку и унификацию данных:\r\nа) если в сведениях о судимости присутствовали несколько дат осуждения или погашения судимости, мы прикладывали максимум усилий, чтобы разделить статьи для каждого осуждения и выделить эти даты.\r\nб) если в сведениях о судимости присутсвовали несколько статей с указанием частей или пунктов, мы мы прикладывали максимум усилий, чтобы разделить статьи и унифицировать статьи.\r\n\r\nМы не занимались сбором иных сведений о кандидатах, их преступлениях и т.д.\r\n\r\nСтатистика\r\nСведения о выдвижениях в представительные органы сельских и городских поселений агрегированы до муниципальных районов (всего – 24), сведения о выдвижениях в Городское Собрание города Обнинск, Городскую Думу Калуги и Законодательное собрание Калужской области показаны как есть. Таким образом, агрегированные сведения представлены для 27 субъектах.\r\nВ таблице ниже для каждого из 27 субъектов оказано количество выдвижений (Выдв) и уникальных кандидатов (Канд), в том числе с судимостью (Суд) и с более чем 1 судимостью (Суд+).\r\n\r\n\r\n\r\nЭти же цифры, но теперь в виде плиточной карты.\r\n\r\n\r\n\r\n\r\n\r\n\r\nАналогичную карту построим для кандидатов с несколькими судимостями.\r\n\r\n\r\n\r\nО судимостях кандидатов\r\n\r\nКандидат, выдвигаясь на выборах, обязан указывать информацию о своей судимости, даже если она снята или погашена. Сведения об этом должны будут обязательно указываться в бюллетене и публиковаться на информационных стендах, где вывешивается информация о кандидате.Сведения о судимости кандидатов будут доступны избирателям на выборах. РИА Новости. 19.02.2014\r\n\r\n\r\nКандидат вправе не предоставлять данные только в случае декриминализации статьи, по которой он был осужден. КС РФ: при регистрации на выборах необходимо сообщать о судимости даже при амнистировании. ТАСС. 05.04.2016\r\n\r\n\r\nСокрытие данных о судимости в последние годы стало достаточно частой причиной для отказа в регистрации: по данным ЦИК, в 2014 г. органы МВД выявили 240 кандидатов от 28 партий, представивших недостоверные сведения о судимости. Проблемы были у всех партий, подтверждает руководитель юридической службы КПРФ Вадим Соловьев: требование указывать судимость не вызывает возражений, конфликты возникали из-за отсутствия четких и однозначных правил. “Избиратели вправе знать о судимости кандидатов даже в случае амнистии”. Газета “Ведомости”. 06.04.2016\r\n\r\n\r\nЗаконодатель обязал кандидатов в своих заявлениях о согласии баллотироваться указывать сведения о когда-либо полученных судимостях при наличии , – сказала Председатель ЦИК России. – А если судимость снята или погашена, необходимо представить сведения о дате снятия или погашения судимости. За три с половиной года действия этой нормы, – продолжила Элла Памфилова, – около 250 кандидатов не были допущены на выборы разных уровней, так как на день голосования не прошло 10 или 15 лет с момента снятия или погашения тяжких или особо тяжких судимостей соответственно. Или имелись судебные решения по их экстремистской деятельности». “Разъяснение ЦИК России о действующих нормах по ограничению права быть избранными лиц, имевших судимость”. Сайт ЦИК России. 15.11.2017\r\n\r\n\r\nОколо 2,2% решивших баллотироваться 9 сентября в региональные и муниципальные депутаты имеют судимость. Каждый 50-й: сколько претендентов в депутаты заявили о своей судимости. РБК. 04.09.2018\r\n\r\nВ Калужской области доля кандидатов с судимостью в выборах 2009-2023 гг. – 1.43% (в целом, как по стране).\r\nАнализ статей УК\r\nВ таблице представлена статистика по статьям УК. Статьи разных кодексов (РФ, СССР и некольких других стран) объединены в столбце “Статьи” и там, где это возможно, отнесены к разделам и главам действующего УК РФ.\r\n\r\n\r\n\r\n\r\nСамые частые статьи – Кража и Хулиганство, но спектр впечатляет – встречаются грабёж, побои, умышленное причинение тяжкого вреда здоровью, изнасилование, психологическое принуждение… именно по этой причине стоит ходить на все выборы и смотреть за что так предлагают голосовать.\r\n\r\nНравятся наши материалы? 👉 ТГ-канал Regina Lab\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nВыборы Калужской области (Часть 1. Кандидаты с судимостью). // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-elections-part1-sudimost/. - Дата публикации: 30 июня 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPebesma E (2018). “Simple Features for R: Standardized Support for\r\nSpatial Vector Data.” The R Journal, 10(1), 439-446. doi:\r\n10.32614/RJ-2018-009 (URL: https://doi.org/10.32614/RJ-2018-009),\r\n<URL: https://doi.org/10.32614/RJ-2018-009>.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-elections-part1-sudimost/images/cands_share_kaluga_tiles.png",
    "last_modified": "2024-06-30T00:41:19+03:00",
    "input_file": "kaluga-elections-part1-sudimost.knit.md",
    "preview_width": 1697,
    "preview_height": 964
  },
  {
    "path": "posts/kaluga-tilemap/",
    "title": "Плиточная карта Калужской области",
    "description": "Гибкий шаблон для сравнительной визуализации субъектов Калужской области (муниципальные районы, городы областного значения).",
    "author": [],
    "date": "2024-06-26",
    "categories": [
      "визуализация",
      "калужская область",
      "плиточная карта"
    ],
    "contents": "\r\n\r\nContents\r\nДетали\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nПлиточные карты (tilemaps) Российской Федерации вошли в обиход и российских новостных агентств. Такие картоиды удобны для сравнения количественных показателей территорий, чьи размеры на карте отличаются настолько существенно, что затрудняется восприятие надписей или цветовых кодировок.\r\nТак, например, компактные небольшие шрифты, необходимые для подписей на карте России субъектов Северо-Кавказского федерального округа, затеряются над Красноярским краем и Магаданской областью. Аналогичная проблема возникает и при цветовой кодировке какого-нибудь количественного показателя – вполне возможно, что размер оказывает влияние на восприятие разницы между цветами – мозг лучше сравнивает цвета для обектов одинаковых форм (ссылку на исследование искать лень). И здесь на помощь приходят плиточные карты, на которых сравниваемые объекты представлены геометрическими одинаковыми фигурами, внутри которых значения количественных показателей можно показывать цветом заливки, цифрами и даже графиками.\r\nЕдинственная проблема плиточных карт – абстрактный характер взаимного расположения плиток. Так, например, расположение субъектов РФ на карте невозможно представить в виде группы квадратов (или иных одинаковых многоугольников) таким образом, чтобы фигуры, соответствующие субъектам, соседствовали друг с другом строго так же как субъекты. Подробнее об этом в постах Единой медиа группы и Ивана Дианова.\r\nИ тут мы подумали, а почему бы не построить такую же карту для Калужской области? Сделали, конечно.\r\n\r\n\r\n\r\nДетали\r\nВ таблице ниже приведены номера строк и столбцов субъектов в воображаемой прямоугольной сетке (таблице), соответствующих субъекту Калужской области.\r\nВы можете скопировать таблицу в Excel и, применив пару формул, создать автоматический построитель плиточных карт Калужской области для собственных задач. Или с помощью языков программирования, или руками… в общем, пользуйтесь на здоровье.\r\n\r\n\r\n\r\nМы выпускаем дизайн с открытой лицензией, соответствующей условиям международной лицензии Public Domain (СС0), что означает следующее – можно изменять и использовать дизайн (расположения, обозначения) карты в любых, в том числе в коммерческих целях. Ссылаться на Regina Blog не обязательно (но нам будет приятно).\r\nНравятся наши материалы? 👉 ТГ-канал Regina Lab\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nПлиточная карта Калужской области // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-tilemap/. - Дата публикации: 26 июня 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPebesma E (2018). “Simple Features for R: Standardized Support for\r\nSpatial Vector Data.” The R Journal, 10(1), 439-446. doi:\r\n10.32614/RJ-2018-009 (URL: https://doi.org/10.32614/RJ-2018-009),\r\n<URL: https://doi.org/10.32614/RJ-2018-009>.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-tilemap/images/ko_maps.png",
    "last_modified": "2024-06-30T00:41:06+03:00",
    "input_file": "kaluga-tilemap.knit.md",
    "preview_width": 2116,
    "preview_height": 1058
  },
  {
    "path": "posts/kaluga-tg-municipal-unique/",
    "title": "Telegram Калужской области. Часть 3. Невидимая рука",
    "description": "Массовые посты и креативные emoji  - анализ уникальности публикаций в ТГ-каналах органов власти районов и поселений Калужской области.",
    "author": [],
    "date": "2024-04-21",
    "categories": [
      "сми",
      "телеграм",
      "власть",
      "управление"
    ],
    "contents": "\r\n\r\nContents\r\nСкорость рассылок\r\nПример 1\r\nПример 2\r\nИтоги\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\n\r\nПродолжаем наше исследование Телеграм-каналов (далее – ТГК, канал, каналы) Калужской области и в “День местного самоуправления” решили заглянуть в каналы районных и поселенческих администраций. Даже те из читателей, которые не могут похвастаться наблюдательностью, при просмотре официальных ТГ-каналов сельских поселений области очень скоро заметят, что перед ними мелькают одни и те же публикации. Нет, речь не репостах, а именно о “идентичных” постах, плюс/минус смайлик.\r\nСобственно, это и определило наши следующие шаги:\r\nразделили все каналы на 3 условных группы (А. ТГК первых лиц районов и городов, Б. ТГК администраций районов, Калуги и Обнинска, В. ТГК администраций и других органов (думы, собрания), а также депутатов.\r\nподсчитали для каждого канала долю репостов, уникальных постов, а также таких постов, идентичные копии которых встречаются в других ТГК (см. Таблицу 1).\r\nдля районов и городов областного значения подсчитали среднюю доля постов каждого типа для каждой группы (иллюстрация).\r\n\r\n\r\n\r\n\r\nПример прочтения таблицы 1. Введём в поле для поиска “павлин”, что отфильтрует строку для канала “Администрация СП”Село Павлиново”. В этом канале группы В было опубликовано 85 постов, 100% из которых встречаются более чем в 10 других каналах. Иными словами, всё то, что опубликовано в этом канале, можно прочесть не менее чем в 10 других.\r\n\r\nСреди ТГК первых лиц (группа А) самые высокие показатели уникальности у каналов главы Боровска и главы Обнинского городского собрания (последний не особо писуч и больше известен комическим даром, но раз вышел в лидеры, против цифры не попрёшь).\r\n\r\n\r\n\r\nНа иллюстрации показаны усредненные показатели для районов и городов областного значения.\r\n\r\n\r\n\r\n\r\nМассовые посты (10+ копий) составляют 36% от общего числа всех постов в группах А, Б и В.\r\n\r\nНу, вообще, мы с пониманием относимся к деревенскому быту – куда там в телеграмы эти писать, когда “утром покос, вечером надои”? И наверное, разведя руками, оставили бы эту тему, но бросилась нам в глаза одна деталь – время публикации.\r\nСкорость рассылок\r\nИз выбранных нами каналов мы выделили 3,123 текстов, копии которых разошлись по более чем 10 каналам (массовые посты). Под текстом мы подразумеваем последовательность слов без пунктуации, тэгов, emoji и форматирования, которые часто используются для придания посту “видимой” уникальности.\r\n\r\n73% массовых постов были опубликованы в течение 1 минуты (сразу во всех каналах, где они в итоге появились), 93% – в течение 24 часов.\r\n\r\nПример 1\r\nНаибольший тираж в 2024 году получил пост:\r\n\r\n“Победа Владимира Владимировича – победа каждого жителя нашей страны!”. В этом уверен областной депутат Александр Козлов. Он отметил, что на своем избирательном участке видел много семей - и это радует, ведь от голосов каждой российской семьи зависит наше будущее. Как результат - легитимные выборы и рекордная поддержка президента.\r\n\r\n\r\n\r\n\r\nКопии этого поста появились в 230 ТГ-каналах в 20 различных версиях (Таблица 2). Можно видеть, как творчески менялся контент для ТГ-каналов отдельных районов Калужской области.\r\n\r\n\r\n\r\nНа иллюстрации показана динамика публикации перечисленных в Таблице 2 версий поста. Для наглядности посты сгруппированы в 10-минутные интервалы.\r\n\r\n\r\n\r\nПорадовало время публикации в ТГ-каналах Юхновского района – словно забыли, а потом, уже собираясь домой, такие: “А юхновцам сообщили?” И быстрее-быстрее, без всяких смайликов и тэгов, хоть в ночь, но таки успели отправить.\r\nПример 2\r\n\r\n\r\n\r\nЕще одим пример массового поста, который был разослан 11 июля 2022 года:\r\n\r\n👍Новые возможности для жителей села. Правительство расширило программу «Сельская ипотека». Теперь по ставке не более 3% можно взять в кредит до 6 миллионов рублей на строительство дома или покупку квартиры. Сумма удвоилась, а это значит, что комфортное жилье станет доступнее.\r\n\r\nКопии этого поста появились в 114 ТГ-каналах в 15 различных версиях (Таблица 3). Здесь уже без спешки – с чувством подобранные emoji и аккуратные тэги.\r\n\r\n\r\n\r\nНа иллюстрации показана динамика публикации перечисленных в Таблице 3 версий поста, посты также сгруппированы в 10-минутные интервалы.\r\n\r\n\r\n\r\nИтоги\r\nЧто же мы наблюдаем?\r\nв ТГК администраций и представительных органов власти в районах Калужской области более трети постов имеют признаки массовой (централизованной) рассылки.\r\nТаинственная(?) невидимая рука, управляющая информированием народных масс, имеет склонность к креативу. Общественный спрос на разнообразие удовлетворяется тэгами и вдохновляющими emoji.\r\nНаибольшее количество уникальных постов наблюдается в ТГ-каналах публичных лиц (глав администрации).\r\n\r\nВ День местного самоуправления желаем главам всех администраций побольше автономии, сил, ресурсов и креативности!\r\n\r\nНравятся наши материалы? 👉 ТГ-канал Regina Lab\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nTelegram Калужской области. Часть 3. Невидимая рука // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-tg-municipal-unique/. - Дата публикации: 21 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-tg-municipal-unique/images/munic_unique.png",
    "last_modified": "2024-04-21T17:17:29+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1511
  },
  {
    "path": "posts/kaluga-tg-citations-smi-rank/",
    "title": "Telegram Калужской области. Часть 2. Кто цитирует СМИ?",
    "description": "Анализ цитирования 88 калужских СМИ в ТГ-каналах региональной и муниципальной власти, органов общественного и государственного надзора, политических партий и институтов развития региона (всего - 418 каналов) в период с 2023.01 по 2024.03 г. На основе найденных репостов и прямых ссылок (всего - 9682 цитирования) для 53 каналов СМИ построен рейтинг.",
    "author": [],
    "date": "2024-04-15",
    "categories": [
      "сми",
      "телеграм",
      "рейтинг",
      "цитирования"
    ],
    "contents": "\r\n\r\nContents\r\nСМИ-ВЛАСТЬ\r\nСМИ-ОБЩЗАК\r\nСМИ-МУНИЦИПАЛЫ\r\nСМИ-МОЛБИЗ\r\nСМИ-ОСТАЛЬНЫЕ\r\nОБЩИЙ РЕЙТИНГ\r\nЗабытые СМИ\r\nРАЗМЫШЛЕНИЯ\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\n\r\nПродолжаем наше исследование влиятельности Телеграм-каналов (далее – ТГК, канал, каналы) Калужской области и в этой части мы завершаем сравнение ТГК СМИ. Рейтинг, построенный на цитированиях СМИ друг друга (см. Часть 1. Царь горы), конечно, кое-что говорит об уважении со стороны коллег, но полноценное признание узнается по цитированиям в официальных каналах субъектов публичной власти и органов общественного надзора.\r\nПопробуем взглянуть на калужские СМИ (Таблица 1) с этой стороны.\r\n\r\n\r\n\r\nСМИ-ВЛАСТЬ\r\nВ группу ВЛАСТЬ мы включили 36 ТГК, которые ведут сотрудники Администрации Губернатора и Правительства Калужской области, руководители региональных министерств и некоторых подведомственных организаций. В таблице 2 перечислены ТГК из группы ВЛАСТЬ и их характеристики.\r\n\r\n\r\n\r\nВ таблице 3 для каждого из каналов группы ВЛАСТЬ приведен перечень процитированных ТГК группы СМИ с дополнительными метриками (см. пояснения в подписи).\r\n\r\n\r\n\r\n\r\nПример прочтения таблицы 3. В канале Варвары Антохиной мы обнаружили 11 цитирований 2-х ТГК группы СМИ – 10 цитирований (91%) канала “ES! - канал Евгения Серкина” и 1 цитирование (9%) канала “Наш Боровский район”. Для первого канала цитирования Варвары Антохиной составили 37% от всех цитирований в ТГК группы ВЛАСТЬ, а для второго канала это единственное упоминание (100%).\r\n\r\nНа иллюстрации показаны обнаруженные цитирования.\r\n\r\n\r\n\r\n\r\n\r\n\r\nСтроки отсортированы по убыванию N_цит_ТГК, но в интерактивной таблице выше, нажав на название столбца, можно пересортировать строки по значениям любого другого столбца.\r\nНаблюдения:\r\nТГК группы ВЛАСТЬ слабо цитируют ТГК СМИ – из 88 ТГК СМИ, включенных в исследование, цитировались лишь 16.\r\nпо совокупности показателей можно говорить о лидерстве канала “Ника”, за которым следует “ES! - канал Евгения Серкина” (оба имеют самое высокое по группе значение индекса Хирша).\r\nСМИ-ОБЩЗАК\r\nВ группу ОБЩЗАК были отнесены 13 ТГК, которые ведут представители Законодательного собрания КО, Общественной палаты КО, общественных советов, а также уполномоченные по правам. Если взаимоотношения СМИ с представителями группы ВЛАСТЬ регулируются федеральными законами, в том числе антимонопольного характера, то “общественники” при выборе, какое СМИ процитировать, на наш взгляд, могут руководствоваться личными симпатиями, сложившимися отношениями или рекомендациями со стороны. Это наше оценочное суждение, возможно, для некоторых организаций взаимодействие с СМИ регулируется положениями устава или внутренними нормативными документами.\r\nВ таблице 5 перечислены ТГК из группы ОБЩЗАК и выборочные характеристики содержащихся в них постов.\r\n\r\n\r\n\r\nВ таблице 6 для каждого из каналов группы ОБЩЗАК показан перечень процитированных ТГК группы СМИ с дополнительными метриками (см. пояснения в подписи).\r\n\r\n\r\n\r\n\r\nПример прочтения таблицы 6. В канале ЕФРЕМОВА|Будни депутата мы обнаружили 4 цитирования 2-х ТГК группы СМИ – 3 цитирования (75%) канала “Моя Калуга” и 1 цитирование (25%) “ES! - канал Евгения Серкина”. Для ТГ-канала “Моя Калуга” цитирования в канале “ЕФРЕМОВА|Будни депутата” составляют 100% от всех цитирований в ТГК группы “ОБЩЗАК”, а для канала Евгения Серкина - 12%.\r\n\r\nНа иллюстрации наглядно видны сложившиеся отношения.\r\n\r\n\r\n\r\n\r\n\r\n\r\nСтроки отсортированы по убыванию N_цит_ТГК, но в интерактивной таблице выше, нажав на название столбца, можно пересортировать строки по значениям любого другого столбца.\r\nНаблюдения:\r\nТГК группы ОБЩЗАК еще слабее цитируют СМИ, чем ТГК группы ВЛАСТЬ – из 88 СМИ каналов цитировались лишь 8.\r\nнаибольшее количество цитирующих каналов ОБЩЗАК также у каналов “Ника” и “ES! - канал Евгения Серкина”.\r\nобращает на себя внимание видимость обнинского школьного СМИ (канал “ШОК”).\r\nСМИ-МУНИЦИПАЛЫ\r\nВ группу МУНИЦИПАЛЫ отнесены 327 ТГК, которые ведут представители администраций районов, городских и сельских поселений. В таблице 8 перечислены ТГК группы МУНИЦИПАЛЫ и характеристики содержащихся в них постов.\r\n\r\n\r\n\r\nВ таблице 9 для каждого из каналов группы МУНИЦИПАЛЫ показан перечень процитированных ТГК группы СМИ с дополнительными метриками (см. пояснения в подписи).\r\n\r\n\r\n\r\n\r\nПример прочтения таблицы 9. В канале “Это Голубев” мы видим 13 цитирований 3-х ТГК группы СМИ – 6 цитирований (46%) канала “ES! - канал Евгения Серкина”, 5 (38%) – “НИКА” и 2 (15%) – “Таруса здесь и сейчас”. Для указанных 3 СМИ цитирования в канале “Это Голубев” составляют 2%, 2% и 5%, соответственно.\r\n\r\nНа иллюстрации показана только структура отношений, названия МУНИЦИПАЛОВ не приведены из-за пространственных ограничений иллюстрации, но все цитирования можно найти в таблице 9, используя поле для поиска.\r\n\r\n\r\n\r\n\r\n\r\n\r\nСтроки отсортированы по убыванию N_цит_ТГК5, но в интерактивной таблице выше, нажав на название столбца, можно пересортировать строки по значениям любого другого столбца.\r\nНаблюдения:\r\nпо количеству ТГК из группы МУНИЦИПАЛОВ, активно цитирующих СМИ (метрика N_цит_ТГК5), лидеры не изменились – “Ника”, а за ней “ES! - канал Евгения Серкина”.\r\nТГК группы МУНИЦИПАЛЫ более активны в цитировании СМИ – из 88 СМИ каналов цитировались 48. Лояльность и внимание муниципальных администраций к “своим” районным СМИ ожидаемо высока – следом за лидерами идут “Юхнов. Про настоящее”, “Хвастовичи сегодня”, “На районе – Думиничи”, “Юхновские вести”, “Таруса здесь и сейчас”, “Жуковский вестник” и др.\r\nканалы, которые позволяют открыто критиковать действия региональных властей (КО_лужа, Сорок_А, Калужский мечтатель), никто из МУНИЦИПАЛОВ цитировать не рискнул.\r\nСМИ-МОЛБИЗ\r\nМежду ТГК из групп МОЛОДЁЖЬ и БИЗНЕС немало общего – авторы каналов реализуют направления госполитики, которые никогда не выпадают из фокуса (это вам не “углеродные полигоны”). По этой причине, и молодёжку, и предпринимателей ведут опытные организаторы побед, умеющие и продукт упаковать, и гранты получить, и на фотографии с лидером выглядеть сообразно статусу. Мы предположили, что и с журналистами эти группы ведут себя схожим образом. Куда им без СМИ? Значит, как-то должны налаживать отношения.\r\nВ группу МОЛБИЗ были отнесены 24 ТГК (Таблица 11).\r\n\r\n\r\n\r\nВ таблице 12 для каждого из каналов групп БИЗНЕС и МОЛОДЁЖЬ показан перечень процитированных ТГК группы СМИ с дополнительными метриками (см. пояснения в подписи).\r\n\r\n\r\n\r\n\r\nПример прочтения таблицы 12. В канале “Агентство развития бизнеса” мы видим 4 цитирования 2-х ТГК группы СМИ – 3 цитирования (75%) канала “ES! - канал Евгения Серкина” и 1 (25%) – “Людиновский стандарт”. Для “ES! - канал Евгения Серкина” цитированя в канале “Агентство развития бизнеса” составляют 9% от всех цитирований в ТГК группы МОЛБИЗ, а у канала Людиновский стандарт - это единственное цитирование (100%).\r\n\r\nНа иллюстрации показана структура сети и цитирования.\r\n\r\n\r\n\r\n\r\n\r\n\r\nСтроки отсортированы по убыванию N_цит_ТГК5, но в интерактивной таблице выше, нажав на название столбца, можно пересортировать строки по значениям любого другого столбца.\r\nНаблюдения:\r\nТГК, отнесенные к группам БИЗНЕС и МОЛОДЁЖЬ, неожиданно слабо цитируют СМИ\r\nв лидерах те же 2 канала, что и в предыдущих рейтингах, с одним отличием – “НИКА” уступила первенство.\r\nСМИ-ОСТАЛЬНЫЕ\r\nМы не стали отдельно рассматривать редкие цитирования СМИ в ТГК-групп ИДЕОЛОГИЯ, НАДЗОР и СТОЛИЦА (условно – ИНС), приведем их в отдельной таблице.\r\n\r\n\r\n\r\nОБЩИЙ РЕЙТИНГ\r\nВот мы и добрались до финального рейтинга, который построим на основании цитирований СМИ в ТГК всех рассмотренных выше групп. Это означает, что мы будем учитывать все цитирования каналов СМИ, кроме тех, где СМИ цитируют друг друга или себя любимых.\r\nКакая метрика лучше для оценки? - индекс Хирша (h), количество цитирующих каналов (N_цит_ТГК), количество ТГК, которые процитировали не менее 5 раз (N_цит_ТГК) или общее число цитирований (Сумма и Сумма2)?\r\nМы склоняемся к варианту с ранжированием в следующем порядке:\r\nпо убыванию индекса Хирша (этот показатель отражает количество “устойчиво цитирующих” ТГК, ограничивая влияние накруток через “близкие каналы” и “одноразовых” цитирований). Если у канала h = 5, значит есть 5 ТГК, которые цитировали рассматриваемый канал не менее 5 раз. Для того, чтобы увеличить значение индекса Хирша (h) до 7, недостаточно начать теплее дружить с имеющимися пятью, надо чтобы появилось 7 каналов и от каждого минимум по 7 цитирований.\r\nпо убыванию количества ТГК, которые процитировали минимум 5 раз\r\nпо убыванию количества ТГК, которые процитировали хотя бы 1 раз\r\nпо убыванию количества цитирований, суммированного с удельным весом ссылок\r\n🥁 🥁 🥁 🥁 🥁\r\n\r\n\r\n\r\n\r\nВывод о том, кто Царь Горы среди калужских СМИ, читатель без труда сделает самостоятельно!\r\n\r\nЗабытые СМИ\r\nНам прах земной взамен бумаги будет,В него слезами впишем нашу скорбь.\r\nВ таблице 16 приводим перечень ТГК СМИ, которых ни разу не цитировали в ТГК 8 рассмотренных выше групп.\r\n\r\n\r\n\r\nРАЗМЫШЛЕНИЯ\r\n🧐 Усиление вертикальных структур управления приводит к деградации отношений между публичной властью и СМИ. Зачем обращать внимание на районные СМИ, когда всё доложит пресс-служба? Стоит ли цитировать местных журналистов, когда твою повестку согласуют кураторы? В таких условиях неибежно возрастает риск деградации отдельных СМИ с превращением в поставщика услуг.\r\n🧐 Было бы направильно переложить всю ответственность на осторожность “класса представителей”. Региональные СМИ довольно разнообразны в своём понимании того, что такое “профессиональные стандарты”. Конечно, не всякий руководитель или политик захочет цитировать канал, владелец которого периодически путает кнопку “Опубликовать” с кнопкой смыва. Увы, не редкость.\r\nНравятся наши материалы? 👉 ТГ-канал Regina Lab\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nTelegram Калужской области. Часть 2. Кто цитирует СМИ? // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-tg-citations-smi-rank/. - Дата публикации: 15 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-tg-citations-smi-rank/images/cit_sm_vl.png",
    "last_modified": "2024-04-15T13:39:05+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-tg-citations/",
    "title": "Telegram Калужской области. Часть 1. Царь горы",
    "description": "Новый проект о ТГ-каналах Калужской области начинаем с анализа сети цитирования ТГ-каналов СМИ. Материал содержит доступный для скачивания рейтинг 80 ТГ-каналов калужских СМИ, построенный по индивидуальной методике на основе первичных данных (никакого TGStat).",
    "author": [],
    "date": "2024-04-13",
    "categories": [
      "сми",
      "телеграм",
      "рейтинг",
      "цитирования"
    ],
    "contents": "\r\n\r\nContents\r\nГруппы каналов\r\nКритерии отбора\r\nРейтинги\r\nТип 1. Репост\r\nТип 2. Ссылка\r\nТип 3. Упоминание\r\nСМИ-СМИ\r\nПланы\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\n\r\nВ начале апреля мы переключились на Телеграм-каналы Калужской области.\r\nСначала на небольшой выборке из 36 каналов мы провели первые эксперименты, рассмотрев использование в постах наречий и эмодзи (🦌🌺🐰🦐🍺🍬).\r\nПришло время повысить ставки и масштабировать проект до нашей исходной задумки. Мы хотим проанализировать ТГ-каналы Калужской области, авторы которых в силу статуса имеют полномочия или даже обязанность влиять на общественное мнение по широкому кругу вопросов. Наши герои – депутаты, госслужащие, журналисты, руководители организаций, члены общественных советов и иные публичные персоны, претендующие на принадлежность к касте “представителей”.\r\nВ итоге мы выбрали 504 ТГ-каналов (см. “Критерии отбора”) и выгрузили 799,407 постов, из которых:\r\n55,552 являются репостами,\r\n726,726 содержат текст (остальное – картинки),\r\n315,095 содержат emoji,\r\n323,583 содержат URL-адреса,\r\n138,986 содержат #тэги,\r\nВ таблице ниже для каждого из каналов показаны основные характеристики.\r\n\r\n\r\n\r\nПолучившейся выборкой мы очень довольны 😇 и собираемся её активно использовать для поиска ответов на самые разные вопросы, а начнем с главного:\r\n\r\nКто “…такой Джон Голт?” здесь Царь Горы?\r\n\r\nГруппы каналов\r\nБлизкие по духу каналы мы решили объединить в тематические группы (внимательный читатель мог заметить в таблице выше столбец “Группа каналов”):\r\nВЛАСТЬ 36 каналов: администрация Губернатора КО и Правительство КО.Вынуждены вникать в локальные проблемы и бороться за достижение целевых показателей.\r\nМУНИЦИПАЛЫ 327 каналов: официальные паблики администраций и руководителей районов и поселений).Тоже вынуждены вникать и бороться, но согласно ст. 12 Конституции РФ в пределах своих полномочий самостоятельны и не входят в систему органов государственной власти.\r\nНАДЗОР 8 каналов: Прокуратура, МВД, СК, Роспотребнадзор, и т.д). Хотя они тоже органы государственной власти, но им важны не столько цели, сколько методы.\r\nОБЩЗАК 13 каналов: члены Законодательного собрания, общественных советов и комиссий, и т.д.). Следят за приматами права и соблюдением Конституции.\r\nМОЛОДЁЖЬ 9 каналов: молодёжные парламенты, думы, советы, творческие аквариумы, и т.п.) Рисуют будущее, куют из себя новые кадры.\r\nБИЗНЕС 15 каналов: ГЧП, ТПП, АИРКО, АРРКО, и т.д.) Почти как МОЛОДЁЖЬ, только игры для взрослых и деньги не нарисованные.\r\nСМИ 88 каналов: В этих синдикатах непросто разобраться. Постарались включить как минимум по несколько СМИ из каждого района.\r\nСТОЛИЦА 4 канала.Актив “мягкой силы” Калужской области (вместе с Хохулей).\r\nИДЕОЛОГИЯ 4 канала. Фокус на сложных вопросах или задачах партийного строительства.\r\nКритерии отбора\r\nКритерий 1 В выборку не включены тематические каналы – паблики библиотек, больниц, учебных заведений, домов творчества, избирательных комиссий и т.д. Даже если их авторы иногда отвлекаются от рабочих вопросов, мы решили не забивать выборку объявлениями про выдачу учебников или викторину в клубе “ЗАЗО”?\r\nКритерий 2 Мы старались не включать каналы с совсем маленьким количеством подписчиков, за исключением тех, которые представляют небольшие поселения.\r\nКритерий 3 Каналы, паразитирующие на низких нравах или призывающие к всяким глупостям, отметались без колебаний.\r\nРейтинги\r\nОдин из популярных способов измерения крутости журнала связан с цитированием. Если в канале А размещен репост или какая-то иная гиперссылка на публикацию из канала Б, можно считать что в копилку канала Б прибавилась удельная единица признания (+1). Таким образом, чем больше канал цитируют и репостят, тем выше его авторитет.\r\nПравда, есть одна особенность – несколько каналов, объединенных общими интересами, могут договориться “тереть друг другу спинку по очереди”. Конечно, все эти картельные штучки давно научились определять. У нас все данные на руках, поэтому мы можем обращать внимание не только на общее количество цитирований (канала Б), но также и на количество цитирующих каналов (подобных каналу А). Ну а если почуем неладное, хиршемерку достанем.\r\nРассмотрим 3 типа цитирования и их особенности.\r\nТип 1. Репост\r\nРепосты легко выделить из массива данных с указанием сведений об исходном (процитированном) посте (дата, время, название канала).\r\nВажная особенность от других типов цитирования – в 1 посте может быть только 1 репост.\r\nТип 2. Ссылка\r\nЕсли автор хочет процитировать несколько сообщений, тогда он поставить в тексте одного своего поста любое количество ссылок на оригинальные посты других авторов.\r\nТакие ссылки несложно выделять из постов и мы будем их также использовать для анализа цитирования.\r\nТип 3. Упоминание\r\nЭто самый сложный для анализа тип цитирования, когда автор поста не оставляет гиперссылку на ТГ-канал, а ограничивается упоминанием персоны.\r\nТакие цитирования сложно выделять из текста и ещё сложнее привязывать к профилю реальной персоны, потому что в тексте автора цитаты могут назвать как угодно. Если ФИО распространенные (Ольга Петрова, Сергей Иванов, и т.д.) шансы некорректной привязки упоминания к персоне начинают увеличиваться, поэтому приходится анализировать контекст (используя упомянутые рядом названия организаций и специфичные термины).\r\nДля построения рейтингов мы ограничимся только 1 и 2 типом цитирования.\r\nЕдинственная дилемма – приравнивать ли ссылки к репостам?\r\n\r\nРепост подобен признанию в любви – адресно и безоговорочно. Посты, набитые гиперссылками, подобны бездушному свайпингу.\r\n\r\nЕсли придерживаться такого подхода к оценке влияния, то можно за репост давать 1 балл, а за ссылку 1/m, где m – количество ссылок в посте. Или же любое упоминание считать просто упоминанием и учитывать с весом равным 1. Мы попробуем оба способа.\r\nСМИ-СМИ\r\n\r\nЦарь горы – игра СМИ. Это единственная группа, чья заинтересованность в упоминаниях и цитированиях влияет на доход.\r\n\r\nМы начнем с построения рейтинга на основе цитирований между ТГ-каналами группы СМИ (как одни СМИ цитируют другие СМИ). Поехали!\r\nНиже приведен фрагмент таблицы цитирований с участием ТГ-канала “Сухарик лайф”\r\n\r\n\r\n\r\nВидим, что канал “Сухарик лайф” чаще всего цитировался каналом “Организатор_медиа_Сухиничи” и цитировал чаще всего тоже его. А вот “Моя Калуга”, которая 15 раз процитировала “сухарика”, радостей взаимного цитирования не познала.\r\nНа основе аналогичных данных мы для ТГ-каналов СМИ построили рейтинг.\r\n\r\n\r\n\r\nСтроки отсортированы по убыванию N_цит_ТГК5, но в интерактивной таблице выше, нажав на название столбца, можно пересортировать строки по значениям любого другого столбца.\r\nРезюмируем:\r\nпо количеству цитирующих ТГ-каналов (N_цит_ТГК) лидирует НИКА. В том числе и по количеству ТГ-каналов, которые цитировали не менее 5 раз - НИКУ любят, ценят, цитируют. Идущие следом – канал Евгения Серкина, Калуга 24 и КГВ.\r\nпо значению индекса Хирша (h-index) вперёд выходит канал Евгения Серкина. Но это, конечно, мы ему помогли тем, что включили в выборку много обнинских каналов, которые хотят-не хотят, любят-не любят, а всё же цитируют ES!.\r\nпо общему количеству цитирования вперед вышли “Калужские новости”, которых цитировали всего 9 других ТГ-каналов группы СМИ (для сравнения НИКУ - 50!), но 4 из них цитируют ТГ-канал “Калужские новости” постоянно, что и определяет значение показателя “Сумма”.\r\nЗначения показателя Сумма2 (с удельным весом ссылок) позиции лидеров не меняло. Мы предполагаем, что у СМИ не принято цитировать другие каналы в виде прямых ссылок – или репост, или никак. И всё же в выборке СМИ встречаются ТГ-каналы, для которые значения Сумма и Сумма2 существенно различаются – “КО_лужа”, “Сорок_А” и “ПроходяМиМо”. Их нередко цитировали в постах со множественными ссылками, поэтому при сложении с удельным весом (1/кол-во ссылок) формируется более низкий итоговый балл (Сумма 2), чем при подсчете, который игнорирует различия между репостами и ссылками (Сумма1).\r\n\r\n\r\n\r\nРасположение кружков и их цвет на иллюстрации – результат работы алгоритма, оно не отражает ни географию СМИ, ни их организационные или экономические связи, а учитывает лишь наличие у каналов истории цитирований (в любую сторону). Каналы находятся ближе друг к другу, если у них много общих “партнёров по цитированию”. Например, “ES! - канал Евгения Серкина” находится близко к каналам “Типичный Обнинска” и “Обнинск 040”, а “В Обнинске” к “ЧП Обнинск”. Несмотря на “условный характер” отражения, алгоритм позволяет в общей картине увидеть группы “связанных” каналов.\r\nПланы\r\nЕсли судить только по цитированию внутри группы СМИ, то на титул Царя Горы претендуют 2 ТГ-канала: НИКА и ES!-канал Евгения Серкина.\r\nОднако, победа в категории “СМИ цитирует СМИ” – это хоть и должно греть душу, но ещё не победа.\r\nВ следующей части мы покажем, какие СМИ цитируют ТГ-каналы из групп ВЛАСТЬ, ОБЩЗАК и МУНИЦИПАЛЫ. А потом займемся и всеми остальными группами.\r\nПродолжение следует…\r\nНравятся наши материалы? 👉 ТГ-канал Regina Lab\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nTelegram Калужской области. Часть 1. Царь горы // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-tg-citations/. - Дата публикации: 13 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-tg-citations/images/cit_sm_sm_drl.png",
    "last_modified": "2024-04-15T12:21:48+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-kols-tg-emojis/",
    "title": "Emoji в ТГ-каналах калужских лидеров мнения",
    "description": "Завершаем анализ использования emoji в ТГ-каналах калужских политиков, чиновников, журналистов, медийных персон и общественных организаций. В посте также приведены сведения об использовании emoji из категорий Travel & Places 🚂 и Activities 🥋.",
    "author": [],
    "date": "2024-04-05",
    "categories": [
      "сми",
      "телеграм",
      "emoji",
      "психолингвистика"
    ],
    "contents": "\r\n\r\nContents\r\nКатегория Travel & Places\r\nКатегория Activities\r\nИспользование emoji\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nПродолжаем изучение калужских ТГ-каналов…\r\nВ первой части мы рассматривали использование в телеграмм-каналах наречий, во второй – emoji животных и растений (🦌🐟🌺🐰), в третьей – emoji еды и напитков (🦐🍺🍏🍬).\r\nЭтим постом мы хотим закрыть тему с использованием emoji. Есть ещё 2 категории символов, использование которых нам кажется интересным, поскольку обращается к воображению масс – это Travel & Places (Путешествия) и Activities (активное времяпровождение). Остальные скрепки, пунктуационные знаки и анатомический театр желтоголовиков нам показался не очень интересным.\r\nКатегория Travel & Places\r\n\r\n\r\n\r\nВ таблице ниже для каждого из каналов показаны emoji категории Travel, которые встречаются не более чем в 4 каналах изучаемой выборки (эти emoji можно считать характерными для авторов).\r\n\r\n\r\n\r\nПолученный результат перенесли на иллюстрацию, показав близость пабликов через характерные для каналов emoji.\r\n\r\n\r\n\r\nКатегория Activities\r\nЗдесь мы немного изменили протокол и расширили категорию, добавив в неё спортивных emoji из категории People Body - получилось ещё более активненько. И так как emoji этой категории используются пореже, чем еда или тотемные животные, пришлось повысить порог – в данной категории выбирали emoji, которые встречались не более чем в 5 каналах изучаемой выборки (в предыдущих категориях emoji считали характерными для автора, если они встречались 4 или менее раз).\r\n\r\n\r\n\r\nИ картинка, конечно же…\r\n\r\n\r\n\r\nОМЦ – Обнинский молодежный центр, серьезно?\r\nИспользование emoji\r\nА теперь о главном… насколько часто использует emoji разные каналы?\r\nНа этот вопрос должна ответить иллюстрация ниже.\r\n\r\n\r\n\r\nНаконец-то мы сможем перейти к более интересным темам…\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nОбразы животных в ТГ-каналах калужских лидеров мнения // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-kols-tg-emojis/. - Дата публикации: 5 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-kols-tg-emojis/images/kaluga_tg_emoji_use.png",
    "last_modified": "2024-04-05T21:12:56+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-kols-tg-animals/",
    "title": "Образы животных в ТГ-каналах калужских лидеров мнения",
    "description": "Подсчитываем emoji категории Animals в ТГ-каналах калужских политиков, чиновников, журналистов, медийных персон и общественных организаций.",
    "author": [],
    "date": "2024-04-04",
    "categories": [
      "сми",
      "телеграм",
      "emoji",
      "психолингвистика"
    ],
    "contents": "\r\n\r\nContents\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nПродолжаем изучение калужских ТГ-каналов…\r\nВ первой части мы рассматривали использование в телеграмм-каналах наречий. В этом и нескольких следующих постах мы проанализируем использование emoji – весёлых цветастых значков, всё чаще встречающихся в телеграм-каналах даже официальных лиц.\r\nЭти изображения решают ту же задачу, что и наречия, только быстрее и “сразу в мозг”. А самые сильные изображения, разумеется – символы животных. Древняя штука, почти шаманская…, но пользоваться этим приёмом не стесняются и в эпоху квантовых компьютеров.\r\n\r\n\r\n\r\nВ таблице ниже для каждого из каналов показаны emoji категории Animals, которые встречаются не более чем в 4 каналах изучаемой выборки (эти emoji можно считать характерными для авторов).\r\n\r\n\r\n\r\nПолученный результат перенесли на иллюстрацию, показав близость пабликов через характерные для каналов emoji.\r\n\r\n\r\n\r\nПродолжение следует…\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nОбразы животных в ТГ-каналах калужских лидеров мнения // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-kols-tg-animals/. - Дата публикации: 4 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-kols-tg-animals/images/kaluga_tg_animals.png",
    "last_modified": "2024-04-05T21:13:36+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-kols-tg-food/",
    "title": "Образы еды и напитков в ТГ-каналах калужских лидеров мнения",
    "description": "Подсчитываем emoji категории Foods & Drinks в ТГ-каналах калужских политиков, чиновников, журналистов, медийных персон и общественных организаций.",
    "author": [],
    "date": "2024-04-04",
    "categories": [
      "сми",
      "телеграм",
      "emoji",
      "психолингвистика"
    ],
    "contents": "\r\n\r\nContents\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nПродолжаем изучение калужских ТГ-каналов…\r\nВ первой части мы рассматривали использование в телеграмм-каналах наречий, во второй – перешли на использование образов животных и растений посредством emoji.\r\nСледующие по силе воздействия на сознание масс – образы еды и выпивки. Если древние люди падали ниц при виде рисунка лошади или уходили в рощи обнимать берёзки, то для многих из наших современников образ рая – это all inclusive extra plus с круглосуточным шведским столом и бесплатным алкоголем.\r\nСмотрим….\r\n\r\n\r\n\r\nПолученный результат перенесли на иллюстрацию, показав близость пабликов через характерные для каналов emoji.\r\n\r\n\r\n\r\nP.S. У нескольких каналов появляется emoji с изображением ножа – это вряд ли о еде (у одного из каналов в названии ЧП), но мы решили оставить, как и другие столовые приборы.\r\nПродолжение следует…\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nОбразы еды и напитков в ТГ-каналах калужских лидеров мнения // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-kols-tg-food/. - Дата публикации: 4 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\nYu G (2023). ggimage: Use Image in ‘ggplot2’. R package version 0.3.3,\r\nhttps://CRAN.R-project.org/package=ggimage.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-kols-tg-food/images/kaluga_tg_food.png",
    "last_modified": "2024-04-04T14:15:49+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-kols-tg-part1/",
    "title": "Признаки действия калужских лидеров мнения в Telegram",
    "description": "Анализ уникальных и характерных наречий в ТГ-каналах калужских политиков, чиновников, журналистов, медийных персон и общественных организаций.",
    "author": [],
    "date": "2024-04-03",
    "categories": [
      "сми",
      "телеграм",
      "русский язык",
      "психолингвистика"
    ],
    "contents": "\r\n\r\nContents\r\nКто “они”?\r\nПочему “как”?\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nАнализ телеграм-каналов задумывался нами как первоапрельская забава, но мы немного увлеклись и, кажется, обеспечили себя исследовательским материалом на следующие несколько недель (или месяцев?).\r\nПервая история будет о том, “как они это делают”.\r\nКто “они”?\r\nОни – это авторы ТГ-каналов калужских и обнинских СМИ, органов власти, чиновников, медийных персон и просто инфлюенсеров. Мы не отбирали их по количеству подписчиков, а просто выбрали сначала известные обнинские каналы, а потом добавили к ним каналы региональных СМИ и медийных персон (кого смогли вспомнить). Если Вас забыли, 🤷, не обижайтесь.\r\nПолучилось 36 пабликов (~ 150 тысяч постов).\r\nПочему “как”?\r\nСравнивать тексты министра транспорта и юриста сложно из-за профессиональной лексики, которая определяет выбор имен существительных, прилагательных и даже глагольных форм. Наречия в меньшей степени зависят от рода деятельности говорящего и используются для решения риторических задач. С помощью наречий автор жонглирует глагольными формами, придавая им необходимые вес и окраску, смещая внимание от предмета обсуждения к описанию процессов:\r\n“неотступно преследовать цель”\r\n“несомненно приблизиться к решению”\r\n“энергично взяться за выполнение”\r\n“мыслить позитивно и творчески”.\r\n\r\nМнение лингвиста 👉 Ившина Татьяна Петровна. Риторический потенциал наречия в публицистическом тексте // Вестник ЛГУ им. А.С. Пушкина. 2010. №3. URL: https://cyberleninka.ru/article/n/ritoricheskiy-potentsial-narechiya-v-publitsisticheskom-tekste (дата обращения: 03.04.2024).\r\n\r\nДля того, чтобы проверить наши интуиции, мы извлекли из постов все наречия.\r\n\r\n\r\n\r\nНаиболее употребимые наречия были предсказуемо малоинформативны (сегодня, сейчас, очень, здесь, вместе, теперь и т.д.). Тогда мы удалили наречия длиной менее 9 букв, но рейтинг стал напоминать методичку по менеджменту (полностью, обязательно, практически, оперативно…). Либо мы включили в выборку слишком много представителей органов власти, либо их язык стали копировать даже СМИ (ой, Региночка, завязывай с интуициями).\r\n\r\n\r\n\r\nТогда мы решили взглянуть на наречия, которые в нашей выборке встречаются не более чем в 2 ТГ-каналах, предположив, что так сможем увидеть наречия, характерные для каждого автора.\r\nИ действительно…\r\n\r\n\r\n\r\nДля того, чтобы увидеть в каких ТГ-каналов упоминалось конкретное наречие, введите его в поле для поиска в таблице выше.\r\nПолученный результат перенесли на иллюстрацию, показав близость пабликов через характерные наречия (темными кружками показаны ТГ-каналы, серыми точками – наречия).\r\n\r\n\r\n\r\nВ нескольких пабликах уникальных наречий мы не обнаружили. Плохо ли это? У нас нет ответа на этот вопрос. Возможно, их авторы предпочитают использовать более простой язык, говоря о происходящем без окказиальных интенсификаторов прикрас.\r\nПродолжение следует…\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nПризнаки действия калужских лидеров мнения в Telegram // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-kols-tg-part1/. - Дата публикации: 3 апреля 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-kols-tg-part1/images/kaluga_kols.png",
    "last_modified": "2024-04-03T09:20:17+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-taxi-part3/",
    "title": "Такси Калужской области (часть 3)",
    "description": "События последней недели напомнили о важности регулирования и контроля тех ниш экономики, где нелегальные мигранты находят возможности подработки. Что бы ни говорили лоббисты и эксперты, такси -- именно такая серая зона. На массиве данных о наших такси-поездках по Калужской области (Яндекс Go) с помощью авторской методики анализа происхождения ФИО попробовали оценить уровень гомофилии в парах водитель-владелец.",
    "author": [],
    "date": "2024-03-31",
    "categories": [
      "такси",
      "яндекс",
      "мигранты"
    ],
    "contents": "\r\n\r\nContents\r\nДанные о поездках\r\nДомыслы и гипотезы\r\nСеть водителей и владельцев\r\nНаблюдения и размышления\r\nПассажирам\r\nДальнейшие планы\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nВ предыдущих частях (см. 1 и 2) мы рассматривали перевозчиков и машины, сейчас взглянем на отношения между организаторами такси-перевозок (ООО и ИП) и нанятых ими водителей.\r\nДанные о поездках\r\nУчастники проекта Regina Lab объединили данные о собственных поездках (cм. инструкцию), совершенных по Калужской области в период с 01.03.2021 по 10.03.2024, и отобрали из них такие, в которых ФИО водителя не совпадало с ФИО организаторов перевозки (перевозчика/партнера/парка). Таким образом, в исследование не вошли те, кто катают на своей машине и платят налоги от своего имени. Всего было отобрано 434 поездки.\r\nДомыслы и гипотезы\r\nУчастники проекта никогда не работали в такси, поэтому до прикосновения к данным мы решили сформулировать основные предположения о природе отношений найма в сфере такси:\r\nдобропорядочные местные перевозчики не стремятся привлекать мигрантов из-за многочисленных рисков;\r\nмигранты самоорганизуются для взаимной помощи (и эксплуатации). В части 1 нашего исследования мы показывали бум регистраций ИП с нетипичными для Калужской области фамилиями;\r\nу крупных и у небольших перевозчиков практики найма водителей могут различаться.\r\nДля разметки ФИО водителей и владельцев мы воспользовались нашей методикой отнесения ФИО к одной из двух групп – А (ФИО, имеющие греческое, еврейское, славянское, скандинавское, латинское и германское происхождение) и Б (все остальные ФИО). Подробное описание методики приведено в первой статье цикла см. раздел “Группы А и Б”.\r\nДля ООО мы используем ФИО генерального директора, считая, что именно этот человек полномочен определять политику ведения бизнеса, в том числе границы практик найма.\r\n\r\nВАЖНО! Предлагаемая методика НЕ подразумевает дискриминации представителей какой-либо из групп. Методика применяется исключительно для изучения трудовой миграции и особенностей найма в секторе такси-перевозок. Используются сведения о личных поездках (предоставляемые Яндекс Go) и публичные данные из ЕГРЮЛ, которые третьим лицам не передаются!\r\n\r\nСеть водителей и владельцев\r\nОтношения найма формируют сеть связей между водителями и организаторами такси-перевозок (последних ниже будем называть “Владелец”), в которой можно выделить 3 типа отношений:\r\nТип 1. Отношения, в которых ФИО и водителя такси, и организатора перевозки относятся к группе А, т.е. их можно считать “исторически типичными” для Калужской области.\r\nТип 2. Отношения, в которых ФИО и водителя, и перевозчика относятся к группе Б, т.е. не являются “исторически типичными” для Калужской области.\r\nТип 3. Отношения, в которых организатор перевозок нанимает водителей с ФИО из обоих групп.\r\nНа иллюстрации ниже показаны примеры таких отношений. Примеры заимствуют структуру из реально сущестующих (наших) поездок, но все имена заменены случайным образом на имена из той же самой группы личных имен (А или Б).\r\n\r\n\r\n\r\n\r\nМы не проверяли имена на корректность написания, так они приведены в доступных нам данных из приложения Яндекс Go. При подборе случайного имени учитывалась только группа (А или Б), поэтому на иллюстрации больше женских имён, чем в реальности. Если Вы реальный организатор перевозок, не завидуйте Герману, у которого работают Ольга, Галина, Инесса и Елена. Спросите себя, какие условия работы могли бы привлечь их в Вашу компанию…\r\n\r\nОчевидно, что тип 1 – это те самые добрые русские люди, которые заботятся о своих земляках.\r\nТип 2 – “этнические” такси, в которых с большей вероятностью найдет работу мигрант с водительскими правами.\r\nТип 3 – владельцы машин ради прибыли готовы нанимать водителей хоть с других планет.\r\nОтношения типа 3 олицетворяют либеральный капитализм с его всеобщим равенством перед диктатурой спроса, которому противостоит старый добрый протекционизм, усиленный гомофилией и опытом со-существования.\r\nНа иллюстрации ниже показаны структуры, наблюдаемые в сведениях о наших личных поездках.\r\n\r\n\r\n\r\nНаблюдения и размышления\r\nПоказанные структуры отражают очень малую часть рынка такси Калужской области (анализ ограничен личными поездками нескольких людей).\r\nПоказанные соотношения типов не отражают ситуацию в конкретных районах КО. Несложно представить небольшой населённый пункт, где такси-услуги жёстко контингентированы между участниками картеля.\r\nУ перевозчиков, чья политика найма, по нашим данным, близка к типу 1 или типу 2, могут быть контракты и с другими водителями (которые не попали в анализ).\r\nТип 3 можно назвать преобладающим, при этом самый крупный перевозчик, как мы и предполагали, может себе позволить быть не особо разборчивым в найме. Этот субъект вообще много чего себе может позволить, например, он до сих пор не зарегистрирован в ФГИС “Такси”.\r\nО том, какую опасность для общественного порядка представляют такси-перевозчики, ставящие свой собственный Ordnung превыше федеральных законов, можно узнать из истории Uber и криминальной хроники.\r\n“Короли уездного извоза”, “этнические синдикаты” и “привокзальные бомбилы” будут до последнего сопротивляться включению в реестр, поэтому …\r\nПассажирам\r\nСогласно новому ФЗ в салоне такси должны быть сведения о машине, водителе, перевозчике, номера телефонов для приёма жалоб и предложений, а также информация о тарифах. Поищите глазами QR-код, попробуйте его проверить.\r\nЕсли QR-кода нет, скопируйте номер машины (это несложно сделать в приложении Яндекс Go), перейдите на сайт ФГИС “Такси” (https://www.sicmt.ru/fgis-taksi?type=car) и проверьте присутствие ТС в соответствующем реестре. Да, вводя на экране смартфона капчу, мысленные пожелания успехов и благополучия отправляйте в СИЦ Минтранса РФ.\r\nЧто делать в случае, если Вы уже в машине перевозчика, который игнорирует соблюдение Федерального закона?\r\nЭтот вопрос мы задали руководителю Управления административно-технического контроля Калужской области (ТГ-канал “Станислав Орехов информирует”) и получили следующий ответ:\r\n\r\n-- “Если к вам приехало нелегальное такси, вы можете отказаться от услуги этого такси, сообщить об этом в службу заказа и попросить заменить автомобиль. Также вы можете официально направить заявление с указанием нарушения и информацией об автомобиле в наше управление по адресу: г. Калуга, ул. Плеханова, 45.”\r\n\r\nДальнейшие планы\r\nУвы, оператор ФГИС “Такси” (ФГБУ СИЦ Минтранса России) недавно убрали фильтр по региону и “поставили капчу”, что усложняет проверку нахождения в реестре автоматизированными средствами. Не будем строить домыслы о том, почему они решили закрыть открытый реестр, но мы глубоко разочарованы.\r\nПо-натоящему открытый реестр или API позволили бы создать удобные инструменты для пассажиров (например, ТГ-бота для проверки машин и перевозчиков).\r\nРегиональный реестр Калужкой области теперь ведётся с помощью ФГИС “Такси”. В то, что местные администраторы начнут публиковать реестр на своём сайте, верится с трудом, хотя в ФЗ № 580 от 29.12.2022 есть ст.23.\r\nПо этой причине коллектив Regina Lab принял решение не продолжать изучение рынка такси до тех пор, пока реестры не откроют.\r\nЗадать вопрос авторам.\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nТакси Калужской области (часть 3) // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-taxi-part3/. - Дата публикации: 31 марта 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J,\r\nChang W, Iannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nCsardi G, Nepusz T (2006). “The igraph software package for complex network research.”\r\nInterJournal, Complex Systems, 1695. https://igraph.org.\r\nCsárdi G, Nepusz T, Traag V, Horvát S, Zanini F, Noom D, Müller K (2024). igraph: Network\r\nAnalysis and Visualization in R. doi:10.5281/zenodo.7682609\r\nhttps://doi.org/10.5281/zenodo.7682609, R package version 2.0.2,\r\nhttps://CRAN.R-project.org/package=igraph.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version\r\n2.8.2, https://CRAN.R-project.org/package=magick.\r\nPedersen T (2022). ggforce: Accelerating ‘ggplot2’. R package version 0.4.1,\r\nhttps://CRAN.R-project.org/package=ggforce.\r\nPedersen T (2023). tidygraph: A Tidy API for Graph Manipulation. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidygraph.\r\nPedersen T (2022). ggraph: An Implementation of Grammar of Graphics for Graphs and\r\nNetworks. R package version 2.1.0, https://CRAN.R-project.org/package=ggraph.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package\r\nversion 0.9-6, https://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R\r\npackage version 1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York.\r\nISBN 978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data\r\nManipulation. R package version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version\r\n2.1.4, https://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version\r\n1.2.1, https://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package\r\nversion 0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R\r\npackage version 1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca\r\nRaton, Florida. ISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V,\r\nLeisch F, Peng RD (eds.), Implementing Reproducible Computational Research. Chapman and\r\nHall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and\r\nHall/CRC, Boca Raton, Florida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca\r\nRaton, Florida. ISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-taxi-part3/images/chart3_regx.png",
    "last_modified": "2024-03-31T20:56:32+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1360
  },
  {
    "path": "posts/kaluga-taxi-part2/",
    "title": "Такси Калужской области (часть 2)",
    "description": "На массиве данных о собственных поездках по Калужской области (приложение Яндекс Go) мы измерили отражение машин и перевозчиков в федеральном реестре такси (ФГИС \"Такси\").",
    "author": [],
    "date": "2024-03-22",
    "categories": [
      "такси",
      "яндекс",
      "реестры"
    ],
    "contents": "\r\n\r\nContents\r\nДанные о поездках\r\nГеография перевозчиков\r\nПрисутствие в ФГИС “Такси”\r\nКраткие итоги\r\nТаксистам\r\nПассажирам\r\nИнструкция по выгрузке данных из Yandex\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nПродолжаем исследование такси Калужской области…\r\nНас прежде всего интересует, как повлиял на сектор такси Федеральный Закон № 580 от от 29.12.2022, вступивший в силу 01 сентября 2023 г.\r\n\r\n\r\n\r\nВ первой части мы исследовали, какая доля ИП и ООО, регистрирующихся с основным ОКВЭД 49.32 присутствует в федеральном реестре (ФГИС “Такси”). Но данные о регистрации ООО и ИП – это одно, реальные перевозки – иное.\r\nУчастники проекта Regina Lab объединили данные о собственных поездках в период с 01.03.2023 по 10.03.2024 и получили массив из 355 поездок, совершенных по Калужской области.\r\nДанные о поездках\r\nПользователи приложения Яндекс Go могут скачать с сайта детальную историю своих поездок (cм. инструкцию ниже). История очень детальная – координаты, коэффициенты цен, сведения о машине, перевозчике, парке, водителе. Одним словом, подарок для любителей анализа данных.\r\n\r\nВАЖНО! История поездок содержит персональные данные водителей, поэтому в оригинальном виде их ни в коем случае нельзя распространять. Для выполнения данного анализа участники проекта Regina Lab выгрузили данные о собственных поездках из личных кабинетов Яндекс Go и перед объединением в общий массив удалили все ФИО и контактную информацию!\r\n\r\nГеография перевозчиков\r\nНа долю перевозчиков, зарегистрированных в Калужской области, в нашей выборке пришлось лишь 60% поездок. Кто бы мог подумать, что гастролёры отнимают так много?\r\n\r\n\r\n\r\nПрисутствие в ФГИС “Такси”\r\nНа иллюстрации для каждого месяца показано количество поездок (над столбцом) и доля машин и перевозчиков, которые по состоянию на 13 марта 2024 года присутствуют в ФГИС “Такси”. Показаны только поездки по Калужской области, совершенные перевозчиками, зарегистрированными в Калужской области.\r\n\r\n\r\n\r\nКраткие итоги\r\n\r\n40% поездок были выполнены перевозчиками не из Калужской области\r\nиз транспортных средств, которые достоверно были задействованы в оказании услуг такси в 2024 году на территории Калужской области, доля присутствующих в федеральном реестре на 13 марта 2024 года не превышала 50%\r\nаналогичный показатель для перевозчиков составила менее 20%\r\nФЗ № 580 от 29.12.2022, вступивший в силу с 1 сентября 2023 года, пока не обеспечивает должной прозрачности такси перевозок.\r\n\r\nТаксистам\r\nВсех водителей, операторов и организаторов служб такси, которые соблюдают законодательство Российской Федерации и уважают ПДД, мы от всей души поздравляем с международным днем таксиста. Желаем Вам хороших дорог, надёжных машин, зелёных светофоров и благодарных пассажиров!\r\nПассажирам\r\nСогласно новому ФЗ в салоне такси должны быть сведения о машине, водителе, перевозчике, номера телефонов для приёма жалоб и предложений, а также информация о тарифах. Поищите глазами QR-код, попробуйте его проверить.\r\nЕсли QR-кода нет, скопируйте номер машины (это несложно сделать в приложении Яндекс Go), перейдите на сайт ФГИС “Такси” (https://www.sicmt.ru/fgis-taksi?type=car) и проверьте присутствие ТС в соответствующем реестре.\r\nЧто делать в случае, если Вы уже в машине перевозчика, который игнорирует соблюдение Федерального закона?\r\nЭтот вопрос мы задали руководителю Управления административно-технического контроля Калужской области (ТГ-канал “Станислав Орехов информирует”) и получили следующий ответ:\r\n\r\n-- “Если к вам приехало нелегальное такси, вы можете отказаться от услуги этого такси, сообщить об этом в службу заказа и попросить заменить автомобиль. Также вы можете официально направить заявление с указанием нарушения и информацией об автомобиле в наше управление по адресу: г. Калуга, ул. Плеханова, 45.”\r\n\r\nМы планируем продолжить изучение собственных поездок.\r\nЗадать вопрос авторам.\r\nИнструкция по выгрузке данных из Yandex\r\nУбедитесь, что…\r\nу Вас есть приложение Яндекс-Такси (Яндекс Go)\r\nВы точно совершали хотя бы 1 поездку через приложение\r\nВы помните (или готовы потратить время, чтобы вспомнить) пароль от Яндекса\r\nОписанные ниже действия не требуют знания программирования (мы даже Excel открывать не будем).\r\nОфициальная инструкция от Яндекса суховата, поэтому мы добавили несколько деталей.\r\nвойдите на https://id.yandex.ru/ и авторизуйтесь (если у Вас несколько почтовых адресов, указывать надо тот логин (аккаунт), к которому привязано приложение Такси)\r\nв разделе Данные выбираем “Управлять данными”\r\nдоступ к данным дают только после подверждения своей личности. Введите присланный в смс код и попадете на страницу “Управление данными” https://id.yandex.ru/personal/data\r\nв длинном списке сервисов выберите “Такси”\r\nв открывшемся окне в секции “Скачать данные” выбираем “Заказать новый” (если уже заказывали, то “Скачать архив”).\r\nЯндекс информирует, что подготовка архива займёт какое-то время. Обычно архив собирается за несколько часов, но пишут, что максимальное время —- до 30 дней. Когда архив будет готов, вы получите письмо на почту yandex.\r\nПосле получения письма о готовности данных, войдите снова в раздел “Управлять данными” (https://id.yandex.ru/personal/data).\r\nНад списком сервисов будет заголовок “Архивы с данными”, под которым будет ссылка “1 архив готов”.\r\nВыберите “Такси”, но (важно!) в выпадающем окне нажмите “показать пароль” (обязательно скопируйте!), потом “скачать архив”.\r\nСкачанный файл, не откладывая, разархивируйте, используя скопированный пароль.\r\nВаши поездки в файле ridehistory.json (он самый большой по размеру).\r\n\r\nВАЖНО! Файл ridehistory.json содержит информацию о всех поездках с указанием точного времени, адресов маршрута, тарифного плана, стоимости и т.д. Вероятнее всего, вы не захотите, чтобы эти сведения попали в руки другим людям, поэтому примите меры, чтобы этого не произошло. Ни в коем случае НЕ ОТПРАВЛЯЙТЕ никому этот файл в его оригинальном виде!\r\n\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nТакси Калужской области (часть 2) // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-taxi-part2/. - Дата публикации: 22 марта 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-taxi-part2/images/chart2x_reg.png",
    "last_modified": "2024-03-22T13:28:11+03:00",
    "input_file": {},
    "preview_width": 1965,
    "preview_height": 1058
  },
  {
    "path": "posts/kaluga-taxi-part1/",
    "title": "Такси Калужской области (часть 1)",
    "description": "Анализ 1890 ИП и ООО, зарегистрированных в Калужской области в период с 01.01.2016 по 11.03.2024 года с указанием ОКВЭД 49.32 (такси) в качестве одного из основных. На основании анализа фамилии, имени и отчества ООО и ИП были разбиты на 2 группы - А (типичные для Калужской области ФИО) и Б (остальные ФИО). Для обеих групп построены кривые выживаемости и показано отражение в федеральном реестре такси (ФГИС \"Такси\").",
    "author": [],
    "date": "2024-03-18",
    "categories": [
      "такси",
      "мигранты",
      "реестры"
    ],
    "contents": "\r\n\r\nContents\r\nРегистрация такси в 2016-2024 гг.\r\nГруппы А и Б (методика)\r\nДинамика регистрации (ООО и ИП)\r\nВремя жизни ИП\r\nРеестры такси\r\nОтражение ИП в ФГИС “Такси”\r\nЧто происходит?\r\nЧто делать пассажиру?\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nВ последний год в ТГ-каналах Калужской области стало появляться всё больше жалоб на поведение “новых” таксистов. Видео мы рекламировать не будем, но в летописях потомки прочтут что-то вроде…\r\n\r\n\r\n\r\nВ преддверии профессионального праздника (22 марта отмечается Международный день таксиста) мы решили разобраться с тем, как в Калужской области обстоят дела с этим самым частным извозом.\r\nРегистрация такси в 2016-2024 гг.\r\n\r\n\r\n\r\nМы смогли найти и собрать сведения о регистрации с 2016 года по н.в. ООО и ИП, которые в перечне основных ОКВЭД указали 49.32. (деятельность легкового такси и арендованных легковых автомобилей с водителем), всего – 1984. Некоторые ИНН присутствует в полученном массиве несколько раз по причине ликвидации и повторной регистрации ИП, всего уникальных ИНН – 1890.\r\nКонечно, это капля в море по сравнению с 25 тысячами, которые согласно публичным оценкам официальных лиц зарегистрированы на платформах агрегаторов.\r\nВо-первых, в собранный нами массив не попали самозанятые физлица, работающие через агрегаторов или посредников. Сведения о самозанятых нам не доступны, да и к тому же они не указывают ОКВЭД.\r\nВо-вторых, есть ООО и ИП, у которых 49.32 не включен в основные ОКВЭД.\r\nБудем считать, что собранные нами сведения отражают тех, кто принял решение заниматься такси как основным видом деятельности от своего лица.\r\nГруппы А и Б (методика)\r\nПубличные сведения о регистрации не содержат указаний о порядке получения гражданства индивидуальными предпринимателями, поэтому разделить владельцев и руководителей такси-сервисов на “местных” и “приезжих” не получится. Но, как известно, в Калужской области примерно 90% населения – славяне, поэтому мы будем считать, что для коренных жителей Калужской области характерны русские личные имена, которые имеют греческое, еврейское, славянское, скандинавское, латинское и германское происхождение. Если такие имена мы отнесем в группу А, то всех остальных (группу Б) можно будет считать “приезжими”. Такой подход можно использовать, чтобы оценить изменение деловой активности местных и приезжих жителей Калужской области.\r\n\r\nВАЖНО! Предлагаемая методика НЕ подразумевает дискриминации представителей какой-либо из групп. Методика используется исключительно для изучения трудовой миграции на основании публично доступных сведениях об ИП и руководителях ООО (ЕГРЮЛ) и не подразумевает дальнейшее распространение обработанных данных.\r\n\r\nОчевидно, что в группе А могут оказаться потомки вятичей с такими убеждениями, за которые в средние века выгоняли за городские стены, а в группе Б – люди, которые, несмотря на происхождение фамилии мыслят, говорят и чувствуют на русском языке, как на родном. Данная методика не используется нами для рассмотрения отдельных граждан, но позволяет определить применять формальные критерии для выделения групп и наблюдать за их динамикой по годам.\r\nМетодика отнесения ФИО к группам:\r\nкаждому имени и отчеству присваивали балл – 1 (русские имена), 0 (иные имена) или 0.5 (имена, которые имеют широкое распространение как среди русских, так и среди других национальностей, например, Руслан, Булат или Эльвира);\r\nпроисхождение фамилии менее очевидно, поэтому авторы его определяли по своему усмотрению и только для фамилий с очевидным происхождением. Если в основе фамилии лежит корень русского слова, фамилию считаем русской и присваиваем ей 1 балл (примеры – Вознесенская, Богатырёв, Ножкин, Дубкова и т.д.). Очевидным не-русским фамилиям присваивали 0. Некоторым фамилиям балл не присваивали в силу невозможности определения их точного происхождения (например, Акоев или Якубов);\r\nприсвоение баллов проводили раздельно для фамилий, имен и отчеств, чтобы полная комбинация (ФИО) не влияла на решение (т.е. одно и то же имя или отчество всегда получают одинаковый балл вне зависимости от других частей полного имени);\r\nбаллы, присвоенные фамилии, имени и отчеству, усреднялись. Например, для Льва Николаевича Толстого итоговый балл был бы равен (1+1+1)/3 = 1; для Камилы Валерьевны Валиевой – (0.5+1+0.5)/3 = 0.67. Такой подход позволяет ФИО смешанного происхождения относить к группе А или к группе Б по преобладающим признакам;\r\nФИО, для которых средняя оценка была выше 0.5, были отнесены к группе А, остальные – к группе Б.\r\nТаким образом, используя общедоступные словари личных имен мы смогли разделить ФИО собранных нами регистрантов в калужском такси-бизнесе (для ООО использовали фамилию руководителя) на 2 группы. Теперь мы можем сравнивать значения показателей для групп А и Б, и на основании их изменения делать предположения об изменении деловой активности представителей групп.\r\nДинамика регистрации (ООО и ИП)\r\n\r\n\r\n\r\nв 2019 в Калужской области резко вырос объем регистраций ИП. Количество новых ИП в группе А в 2019 годы выросло более чем в 2 раза по сравнению с 2016 (156 vs. 71), в группе Б – в 7 с половиной раз (346 vs. 45);\r\nс 2020 года поток новых ИП в группу А стабилизировался (немного снизился), в группу Б – снизился почти в 3 раза (с 217 до 82).\r\nКаковы причины наблюдаемого скачка и последующего снижения в 2020-2021 году?\r\nНаиболее вероятными кажутся 2 объяснения:\r\nС 2019 года на территории Калужской области был запущен пилотный проект с особым налоговым режимом для самозанятых. Согласно ФЗ (ч. 1 ст. 9 Федерального закона №69) самозанятые физические лица не могли самостоятельно работать в такси, но могли сначала оформить ИП, а потом перейти на режим самозанятости;\r\nПосле пандемии люди начали возвращаться в общественный транспорт, рынок ответил падением спроса, конкуренция выросла и привлекательность “такси-перевозок” для новых предпринимателей вернулась к прежнему уровню.\r\nВероятно, обе причины имели место.\r\nПредположение о насыщении рынка можно проверить, взглянув на время жизни зарегистрировавшихся ИП – если большая часть новых перевозчиков закрепилась на рынке и до сих пор работают, возможно, предложение действительно избыточно.\r\nВремя жизни ИП\r\nНа иллюстрации ниже светло-серым цветом (верхняя часть столбца) показана доля ИП, которые был ликвидированы (без регистрации нового ИП). Можно видеть, что на водителей групп А и Б, очевидно, действует одни и те же “законы”.\r\n\r\n\r\n\r\nКак видим, выживаемость новых ИП на рынке такси не так уж высока. Около половины ИП, созданных 3-4 года назад, к настоящему моменту ликвидированы, из зарегистрированных в 2018 по данным ЕГРЮЛ ликвидированы, в среднем, 4 из 5 ИП (80%).\r\nКонечно, мы не знаем об истинных причинах ликвидации и, наверное, мы бы погадали о причинах тех событий, но тут появились новые…\r\n\r\nС 01 сентября 2023 года действует ФЗ “О регулировании перевозок легковыми такси”, которые открывает самозанятым возможность работать в такси без необходимости регистрации ИП и без посредников.\r\n\r\nВместе с такой привилегией новый закон устанавливает ряд дополнительных требований, среди которых:\r\nрегистрация машины в реестре транспортных средств\r\nрегистрация перевозчика в реестре перевозчиков\r\nРеестры такси\r\nСначала были региональные реестры. На странице старого портала Правительства КО пока ещё можно найти текст следующего вида Реестр выданных разрешений на осуществление деятельности по перевозке пассажиров и багажа легковым такси для граждан РФ http://62.148.142.10:1080. На ссылку можно не нажимать, сервис уже не работает, поскольку региональные реестры теперь отдают данные в ФГИС “Такси”. Последняя порадовала доступностью данных – мы, конечно, не преминули проверить отражение в нём собранных нами ИП.\r\nОтражение ИП в ФГИС “Такси”\r\nТе ИП из нашего массива, которые сохранили активнось, по идее должны быть в реестре – согласно установленному порядку их должен был передать региональный реестр.\r\nЕсли же предприниматель закрыл ИП, чтобы работать как самозанятое физлицо, то мы тоже должны видеть его в федеральном реестре (ФИО для самозанятых в веб-сервисе ФГИС “Такси” не отражается, а ИНН виден).\r\nНа иллюстрации ниже для ИП групп А и Б, зарегистрированных в 2016-2024 гг., показаны доли:\r\nоставшихся в форме ИП и уже присутствующих в ФГИС “Такси”,\r\nликвидировавших ИП, но присутствующих в ФГИС “Такси” (в качестве самозанятого),\r\nоставшихся в форме ИП, но отсутствующих в ФГИС “Такси”,\r\nликвидировавших ИП и отсутствующих в ФГИС “Такси” (серым цветом).\r\n\r\n\r\n\r\nВ группе А даже среди тех ИП, кто зарегистрировался в годы действия режима самозанятости, не более 22% присутствуют в ФГИС “Такси”. Доля не ликвидированных ИП группы А, которые отсутствуют в федеральном реестре весьма существенна!\r\nЧто касается группы Б, то там процент ИП, проявившихся в федеральном реестре, совсем низкий.\r\nУчитывая на 90% славянское население Калужской области, соотношение численности групп А и Б, действительно, свидетельствует о чрезмерном перекосе в пользу приезжих, что в свою очередь, как любая асимметрия, негативно характеризует рынок такси.\r\nЧто происходит?\r\nМы не являемся специалистами в части регулирования такси и пассажирского транспорта, поэтому сложные прогнозы делать не станем, но подметим следующее:\r\nБольшая часть перевозчиков не успели или не захотели попасть в ФГИС “Такси”. Возможно, это связано с пунктами нового закона (там что-то про локализацию парка и т.д.). Впрочем, о том, что процесс будет идти вяло руководству КО докладывали с лета 2023 года. Губернатор счел ситуацию недопустимой и поручил управлению административно-технического контроля усилить работу со службами такси.\r\nУправление административно-технического контроля Калужской области в своём ТГ-канале теперь активно призывают водителей регистрироваться в реестре и показательно постят отчёты о совместных с ГИБДД рейдах. Процент отказа по заявлениям на получение разрешения составляет всего 2.8%.\r\nПо новому закону службы заказа такси и агрегаторы могут передавать водителю заказы только в том случае, если сведения о нём есть в реестре перевозчиков и реестре такси. Проверять водителей по реестрам службы заказа должны ежедневно.\r\nВ ближайшее время Комитет Госдумы по транспорту планирует рассмотреть поправки, предложенные ко второму чтению закона о локализации машин. Зачем и почему? См. здесь и здесь.\r\nНа regulation.gov.ru сейчас обсуждаются поправки, касающиеся страхования перевозок такси.\r\nДля нас, независимых наблюдателей со стороны, это выглядит как новая фаза передела региональных рынков в пользу федеральных агргегаторов и дешёвой рабочей силы. Что может принести подобная либерализация рынка, было ясно ещё в 2019 году. Правила и запреты люди быстро учатся обходитьЮ тем более когда им помогают Яндекс с их программой прямого партнерства и ушлые предприниматели, оформляющие “под ключ” пакеты документов для гастролирующих водителей.\r\nЧто делать пассажиру?\r\nПомните, по новому ФЗ в салоне такси должны быть сведения о машине, водителе, перевозчике, номера телефонов для приёма жалоб и предложений, а также информация о тарифах. Поищите глазами QR-код, попробуйте его проверить.\r\nЕсли QR-кода нет, скопируйте номер машины (это несложно сделать в приложении Яндекс Такси), перейдите на сайт ФГИС “Такси” (https://www.sicmt.ru/fgis-taksi?type=car) и проверьте присутствие ТС в соответствующем реестре.\r\nЧто делать в случае, если Вы уже в машине перевозчика, который игнорирует соблюдение Федерального закона?\r\nЭтот вопрос мы задали руководителю Управления административно-технического контроля Калужской области (ТГ-канал “Станислав Орехов информирует”) и получили следующий ответ:\r\n\r\nЕсли к вам приехало нелегальное такси, вы можете отказаться от услуги этого такси, сообщить об этом в службу заказа и попросить заменить автомобиль. Также вы можете официально направить заявление с указанием нарушения и информацией об автомобиле в наше управление по адресу: г. Калуга, ул. Плеханова, 45.\r\n\r\nМы планируем продолжить изучение сектора такси и в следующей части погрузимся в данные о реальных поездках.\r\nЗадать вопрос авторам.\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nТакси Калужской области (часть 1) // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-taxi-part1/. - Дата публикации: 18 марта 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-taxi-part1/images/chart1_reg.png",
    "last_modified": "2024-03-19T09:51:00+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1058
  },
  {
    "path": "posts/kaluga-gender-gia/",
    "title": "Какие предметы ЕГЭ выбирают девушки и юноши Калужской области?",
    "description": "По каждому предмету показана динамика распределения по полу выпускников, выбиравших предмет дял ЕГЭ в 2019-2023 гг.",
    "author": [],
    "date": "2024-03-10",
    "categories": [
      "школы",
      "ЕГЭ",
      "ГИА",
      "образование"
    ],
    "contents": "\r\n\r\nContents\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\nПродолжаем изучать данные ЕГЭ школ Калужской области (см. также “Открытый рейтинг школ Калужской области, часть 1”).\r\nПо случаю 8 марта заглянули в таблицы с распределением выбранных предметов ЕГЭ между девушками и юношами, и подготовили несколько иллюстраций.\r\nСобранные сведения приведены в интерактивной таблице ниже, которая позволяет не только сортировать и фильтровать строки, но также сохранять и копировать данные.\r\n\r\n\r\n\r\nВ данных различающиеся значения для одного года усреднили, а французский, немецкий и английский языки объединили в одну группу “Иностранные языки”.\r\nИллюстрация ниже показывает для каждого предмета абсолютное количество выпускников каждого пола.\r\nНаиболее беспокоящий нас тренд – сдающих профильную математику становится всё меньше, а информатику – всё больше.\r\nСерьёзно?\r\n\r\n\r\n\r\nНа второй иллюстрации показана динамика доли девушек и юношей для каждого предмета. Действительно, первые бегут от профильной математики, вторые – от иностранных языков.\r\n\r\n\r\n\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nКакие предметы ЕГЭ выбирают девушки и юноши Калужской области? // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-gender-gia/. - Дата публикации: 10 марта 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOehm D (2023). cropcircles: Crops an Image to a Circle. R package version 0.2.4,\r\nhttps://CRAN.R-project.org/package=cropcircles.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-gender-gia/images/gia_genders.png",
    "last_modified": "2024-03-10T21:04:47+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  },
  {
    "path": "posts/kaluga-schools-rank-part1/",
    "title": "Открытый рейтинг школ Калужской области (часть 1)",
    "description": "Попытка оценить эффективность образовательных учреждений по результатам сдачи ЕГЭ в 2019-2023 гг. Материал содержит интерактивные таблицы с показателями школ и рейтингами.",
    "author": [],
    "date": "2024-03-10",
    "categories": [
      "школы",
      "ЕГЭ",
      "ГИА",
      "образование"
    ],
    "contents": "\r\n\r\nContents\r\nИнформация о школах\r\nГруппа А. Школы со стабильным участием в ГИА-11\r\nГруппа Б. Школы с меньшим количеством сдающих ЕГЭ\r\nГруппа В. Школы с эпизодическим участием в ГИА-11\r\nЭкспресс-сравнение групп\r\n\r\nМетодика оценки\r\nРейтинг школ группы А\r\nРейтинг школ группы Б\r\nРейтинг школ группы В\r\n\r\nШколы Обнинска\r\nОграничения подхода\r\nИсточники данных\r\nПоделиться\r\nСсылка для цитирования\r\nПрава\r\nОтказ от ответственности\r\nСофт\r\n\r\n\r\nПриближается сезон записи в школы и всё чаще в сети Интернет звучат вопросы об их реальном уровне. В России немало рейтингов школ, но практически все они рассчитываются по методикам, которые невозможно проверить. При этом доступных, а тем более открытых данных, которые можно было бы использовать для собственного исследования или воспроизведения рейтингов, напротив, очень мало.\r\nНас давно интересует тема среднего образования и вот мы собрали доступные сведения о школах Калужской области и решили построить собственный рейтинг. Это не заказное и не “профессиональное” исследование, поэтому методику оценки мы придумали сами.\r\n\r\nПочему мы назвали рейтинг “открытым”? Потому что таблицы ниже вы можете не только просматривать, фильтровать и ранжировать, но также сохранить в виде файлов CSV/Excel для того, чтобы проверить наши расчеты или попробовать создать свой собственный рейтинг. Прежде чем использовать или цитировать результаты нашей оценки, пожалуйста, ознакомьтесь с методикой. В случае возникновения вопросов, задайте вопрос авторам.\r\n\r\nДругие материалы по теме можно будет найти в блоге, используя категории “школы” и “образование”.\r\n\r\n\r\n\r\nВ этой части мы будем ранжировать школы на основании результатов сдачи ЕГЭ с 2019 по 2023 гг.\r\nВ тексте ниже будут использованы следующие сокращения: ЕГЭ – единый государственный экзамен, ГИА-11 – государственная итоговая аттестация 11-классников, ВТГ – выпускники текущего года.\r\nИнформация о школах\r\nВ доступных на сайте http://ege.kaluga.ru материалах можно найти таблицы с названием “Рейтинг образовательных организаций по интегральным показателям качества подготовки выпускников”, в которых для каждой школы показана доля (от общего числа) выпускников текущего года (ВТГ), чей суммарный балл по трем выбранным предметам попал в диапазоны:\r\nГ1. до 160 баллов Г2. от 161 до 220 баллов Г3. от 221 до 250 баллов Г4. от 251 до 300 баллов\r\nНа основании этих данных мы разделили образовательные организации на 3 группы и для каждой построили отдельный рейтинг.\r\nГруппа А. Школы со стабильным участием в ГИА-11\r\nДоговоримся считать участие школы в ГИА-11 стабильным, если выполняется любое из двух условий:\r\n(а) в период с 2019 по 2023 год не менее 60 выпускников школы сдавали ЕГЭ,\r\n(б) в период с 2019 по 2023 год выпускники школы участвовали в ЕГЭ не менее 3 раз и при этом в каждый год участвовало не менее 10 человек.\r\nНа основании этих критериев в группу А были отобраны 107 школ, на долю которых приходится 87% выпускников, сдававших ЕГЭ с 2019 по 2023 годы.\r\n\r\n\r\n\r\nГруппа Б. Школы с меньшим количеством сдающих ЕГЭ\r\nВ группу Б мы отнесем школы, которые не попали в группу А из-за того, что в некоторые годы в ЕГЭ принимали участие менее 10 их выпускников, при этом за наблюдаемый 5-летний период в ЕГЭ приняли участие от 15 до 60 выпускников этих школ. В итоге в группу Б попали 57 школ, на долю которых пришлось 11% выпускников.\r\n\r\n\r\n\r\nГруппа В. Школы с эпизодическим участием в ГИА-11\r\nОставшиеся образовательные учреждения, выпускники которых сдавали ЕГЭ с 2019 по 2023 год, попали в группу В. Всего – 62 школ, в каждой из которых за весь наблюдаемый 5-летний период в ЕГЭ приняли участие 15 или менее выпускников. В общем объеме выпускников Калужской области, сдававших ЕГЭ в период с 2019 по 2023 год, учащиеся из школ группы В составляют всего 2.6%.\r\n\r\n\r\n\r\nЭкспресс-сравнение групп\r\nРазличия между группами достаточно наглядны – диаграмма ниже показывает доли выпускников, набравших определенное количество баллов в каждой группе.\r\n\r\n\r\n\r\n\r\nВ школах группы А доля выпускников, набравших от 251 до 300 баллов, почти втрое больше, чем в группах Б и В; доля набравших от 220 до 250 – на 80% выше; а доля тех, кто набрал менее 160 баллов, примерно на 40% ниже.\r\n\r\nМетодика оценки\r\nНа основе имеющихся данных идеальную формулу оценки для построения рейтинга школ по результатам сдачи ЕГЭ придумать точно не получится, поэтому мы придумали несколько собственных моделей для расчета итоговой оценки (в формулах ниже Гx – доля выпускников, набравших баллы, соответствующие группе Х):\r\nМодель М1 (либеральная)\r\n“Все, кто вышел на экзамен, уже победили”\r\nЭто максимально мягкая модель, поддерживающая известную точку зрения “Лучше в школе дядю слушать, чем в подворотне водку кушать”. Но за каждого выпускника, попадающего в группу с более высокими баллами, естественно, будем добавлять более высокие баллы.\r\nФормула: Оценка = 25 • Г4 + 10 • Г3 + 3 • Г2 + Г1\r\nМодель М2 (умеренная)\r\n“За недотянувших до 160 – штраф, за остальных – премируем”\r\nДоля выпускников из групп Г2, Г3 и Г4 складываются с весами 1, 3 и 10; доля попавших в группу Г1 вычитается с весом 5. Модель штрафует школу за плохо подготовленных выпускников.\r\nФормула: Оценка = 10 • Г4 + 3 • Г3 + Г2 － Г1\r\nМодель М3 (практичная).\r\n“За недотянувших до 160 – штраф, премируем только за тех, кто набрал больше 220”\r\nОтличается от модели Б тем, что доля выпускников, отнесенных к группе Г2 не учитывается, остальные веса точно такие же. Группа Г2 – самая многочисленная, именно под неё выравнивается сложность задач ЕГЭ и по этой причине за выпускников группы Г2 школа не получает никаких баллов.\r\nФормула: Оценка = 10 • Г4 + 3 • Г3 － Г1\r\nМодель М4 (радикальная).\r\n“Успех начинается от 220 баллов, остальное – неудача”\r\nДоля выпускников из групп Г1 и Г4 учитываются со степенью 2 (значение возводится в квадрат), доли Г2 и Г3 применяются без весов. Таким образом, школа получает штрафные баллы за выпускников не только группы Г1, но и Г2.\r\nФормула: Оценка = (Г4)2 + Г3 － Г2 － (Г1)2\r\n\r\nШтрафы за выпускников, набравших невысокое количество баллов, отражают следующую точку зрения: каждый выпускник, попавший в группу Г1 – это не только потраченные впустую 2 года молодой жизни с сертификатом о неудаче, но и напрасно потраченные ресурсы школы (бюджетные, капитальные, человеческие). Профессиональное ориентирование и психологический контроль должны были помочь таким ученикам после 9 класса выбрать другие программы развития.\r\n\r\nДля каждой модели (М1-М4) мы рассчитали ранговые значения школ в группах А-В, после чего полученные для организаций ранги усреднили (среднее арифметическое) для получения итогового положения места организации в рейтинге.\r\n\r\nВ таблицах 4 и 5 организации отсортированы по итоговому рангу, но списки школ можно отсортировать по любой из моделей, кликнув на заголовок соответствующего столбца таблицы.\r\n\r\nРейтинг школ группы А\r\n\r\n\r\n\r\nНесмотря на различия между моделями десятка лидеров рейтинга оставалась неизменной – 6 из 10 школ из Обнинска!\r\nПо мере движения вниз по рейтингу влияние модели увеличивается, но даже второй и третьей десятках рейтинга смена модели не приводила к существенной вариативности.\r\nРейтинг школ группы Б\r\n\r\n\r\n\r\nРейтинг школ группы Б характеризуется меньшей стабильностью по сравнению с рейтингом группы А, поскольку группа Б объединяет небольшие школы, среди которых есть как частные образовательные организации (“Радуга”, Обнинский колледж, “Чаша”), так и общеобразовательные школы из небольших населенных пунктов. Вполне возможно, что первые, занявшие более высокие места в рейтинге, могут себе позволить заниматься профотбором и более серьезно занимаются подготовкой выпускников к сдаче ЕГЭ.\r\nРейтинг школ группы В\r\nИз-за малого числа выпускников ранжирование школ группы В по результатам ЕГЭ лишено смысла, поскольку результат будет отражать не уровень школы, а редкие эпизоды (наблюдения).\r\nНапример, если в небольшой сельской школе на ЕГЭ выйдет всего 1 выпускник и наберёт от 251 до 300 баллов, можно ли считать школу лидером региона? Несмотря на финансовые успехи “алкоиндустрии”, земля Русская богата талантами, поэтому такие истории вовсе не редкость.\r\n\r\nВ качестве примера можно привести Асмоловскую среднюю общеобразовательную школу, в которой за 5 лет ЕГЭ сдавали только 3 человека, но один (одна) из них в 2019 году дал школе 100%-ное попадание в группе Г4. Согласно общедоступным данным (Википедия) эта школа обслуживает 36 населенных пунктов, входящих в состав сельского поселения «Деревня Асмолово» с общей численностью населения менее 1000 человек. Из результатов самообследования школы можно узнать, что в 2022 году в ней обучалось всего 25 человек (ни одного в 10 и 11 классах) и, что “в школе качество знаний соответствует низкому уровню. Объяснение данной проблемы педагоги видят в невысоком уровне познавательных интересов обучающихся, низкой мотивации обучающихся к познавательной деятельности.”. Но вот кто-то взял и как следует постарался!\r\n\r\nЧто произойдет, если в школах из группы В перестанут стараться?\r\nОтвет на этот вопрос приведен в таблице 6, где перечислены школы, имеющие лицензию на среднее общее образование, но не появлявшиеся ни разу в статистике ГИА-11 в период с 2019 по 2023 гг.\r\n\r\n\r\n\r\nШколы Обнинска\r\nНаукоград прекрасно представлен в первой десятке обоих рейтингов (А и Б), но не все школы одинаковы. На иллюстрации показаны школы из групп А и Б и их места в рейтингах А и Б (рейтинг устроен таким образом, что одно место могут занимать несколько школ Калужской области, поэтому 40-е место в рейтинге не означает, что впереди 39 школ, их может быть больше).\r\n\r\n\r\n\r\nОграничения подхода\r\nПодход, использованный нами для оценки и ранжирования школ, не лишен изъянов.\r\nПоказатели ЕГЭ не отражают всех достоинств и особенностей сравниваемых школ. В одной школе лучшие дополнительные курсы, в другой – хорошие спортсекции, в третьей – строгое соблюдение порядка, в четвертой – преподаватели, “умеющие в олимпиады”. Учесть подобные показатели мы не имели возможности в силу отсутствия данных.\r\nНесмотря на критику ЕГЭ, на сегодняшний день это важнейшая дверь, отделяющая выпускников от поступления в вузы (“кующие интеллектуальную элиту России будущего”). Предлагаемый нами подход отражает способность школы подводить школьников к этой двери с необходимым запасом навыков и уверенности в силах. Хочется особенно подчеркнуть важность служб профориентации и психологического сопровождения для повышения эффективности подготовки учащихся.\r\nИсточники данных\r\nИ1. Портал Государственная итоговая аттестация в Калужской области ГАОУ ДПО “Калужский государственный институт развития образования”. В разделах “Аналитические и методические материалы ГИА-11” и Статистика опубликованы результаты сдачи ЕГЭ в школах. Конечно, данные с результатами ЕГЭ за 2019, 2022, 2023 доступны в файлах doc/docx, а данные 2020-2021 гг. – в PDF, но и на том спасибо!\r\nИ2. На сайте ГАОУ ДПО «Калужский государственный институт развития образования» http://kgiro.kalugaedu.ru/ в разделе Механизмы управления качеством образовательных результатов доступны сведения по районам и городам КО.\r\nИ3. В разделе “Открытые данные Калужской области” на старом портале органов власти Калужской области можно найти перечень организаций, осуществляющих образовательную деятельность. Эти данные также можно извлечь из Открытых данных Рособрнадзора.\r\nМы вдоволь наупражнялись в методах извлечения и очистки данных. В некоторых таблицах обнаружили несогласующиеся сведения и опечатки (там, где это было возможно, направили оператору данных письма с соответствующими указаниями).\r\nВ будущем мы постараемся добавить новые данные о школах Калужской области.\r\nПоделиться\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nСсылка для цитирования\r\nОткрытый рейтинг школ Калужской области (часть 1) // Блог Regina Lab. - 2024. - URL: https://reginaobninsklab.github.io/posts/kaluga-schools-rank-part1/. - Дата публикации: 10 марта 2024 г.\r\nПрава\r\nЕсли не указано иное, то статья целиком и составляющие её текст, иллюстрации и данные могут использоваться на условиях публичной лицензии Creative Commons CC BY 4.0 Deed Attribution 4.0 International.\r\nОтказ от ответственности\r\nСм. соответствующий раздел на странице “О проекте”.\r\nСофт\r\nAllaire J, Xie Y, Dervieux C, McPherson J, Luraschi J, Ushey K, Atkins A, Wickham H, Cheng J, Chang W,\r\nIannone R (2023). rmarkdown: Dynamic Documents for R. R package version 2.22,\r\nhttps://github.com/rstudio/rmarkdown.\r\nOoms J (2023). magick: Advanced Graphics and Image-Processing in R. R package version 2.8.2,\r\nhttps://CRAN.R-project.org/package=magick.\r\nPedersen T (2024). patchwork: The Composer of Plots. R package version 1.2.0,\r\nhttps://CRAN.R-project.org/package=patchwork.\r\nQiu Y, details. aotifSfAf (2022). sysfonts: Loading Fonts into R. R package version 0.8.8,\r\nhttps://CRAN.R-project.org/package=sysfonts.\r\nQiu Y, details. aotisSfAf (2023). showtext: Using Fonts More Easily in R Graphs. R package version 0.9-6,\r\nhttps://CRAN.R-project.org/package=showtext.\r\nWickham H (2022). stringr: Simple, Consistent Wrappers for Common String Operations. R package version\r\n1.5.0, https://CRAN.R-project.org/package=stringr.\r\nWickham H (2016). ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. ISBN\r\n978-3-319-24277-4, https://ggplot2.tidyverse.org.\r\nWickham H, François R, Henry L, Müller K, Vaughan D (2023). dplyr: A Grammar of Data Manipulation. R\r\npackage version 1.1.2, https://CRAN.R-project.org/package=dplyr.\r\nWickham H, Henry L (2023). purrr: Functional Programming Tools. R package version 1.0.1,\r\nhttps://CRAN.R-project.org/package=purrr.\r\nWickham H, Hester J, Bryan J (2023). readr: Read Rectangular Text Data. R package version 2.1.4,\r\nhttps://CRAN.R-project.org/package=readr.\r\nWickham H, Seidel D (2022). scales: Scale Functions for Visualization. R package version 1.2.1,\r\nhttps://CRAN.R-project.org/package=scales.\r\nWickham H, Vaughan D, Girlich M (2023). tidyr: Tidy Messy Data. R package version 1.3.0,\r\nhttps://CRAN.R-project.org/package=tidyr.\r\nWilke C, Wiernik B (2022). ggtext: Improved Text Rendering Support for ‘ggplot2’. R package version\r\n0.1.2, https://CRAN.R-project.org/package=ggtext.\r\nXie Y (2023). knitr: A General-Purpose Package for Dynamic Report Generation in R. R package version\r\n1.43, https://yihui.org/knitr/.\r\nXie Y (2015). Dynamic Documents with R and knitr, 2nd edition. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 978-1498716963, https://yihui.org/knitr/.\r\nXie Y (2014). “knitr: A Comprehensive Tool for Reproducible Research in R.” In Stodden V, Leisch F, Peng RD\r\n(eds.), Implementing Reproducible Computational Research. Chapman and Hall/CRC. ISBN 978-1466561595.\r\nXie Y, Allaire J, Grolemund G (2018). R Markdown: The Definitive Guide. Chapman and Hall/CRC, Boca Raton,\r\nFlorida. ISBN 9781138359338, https://bookdown.org/yihui/rmarkdown.\r\nXie Y, Dervieux C, Riederer E (2020). R Markdown Cookbook. Chapman and Hall/CRC, Boca Raton, Florida.\r\nISBN 9780367563837, https://bookdown.org/yihui/rmarkdown-cookbook.\r\n\r\n\r\n\r\n",
    "preview": "posts/kaluga-schools-rank-part1/images/school_rank_map.png",
    "last_modified": "2024-03-10T18:53:43+03:00",
    "input_file": {},
    "preview_width": 2116,
    "preview_height": 1587
  }
]
